In [ ]:
# Install PySpark
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.3)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [ ]:
from pyspark.sql import SparkSession

# Initialize SparkSession
spark = SparkSession.builder \
    .appName("Spark SQL Demo") \
    .getOrCreate()

# Check Spark Version
print("Spark Version:", spark.version)

Spark Version: 3.5.3

In [ ]:
# Create sample data
data = [
    ("Alice", 28, "Data Scientist"),
    ("Bob", 35, "Engineer"),
    ("Cathy", 32, "Analyst"),
]

columns = ["Name", "Age", "Occupation"]

# Create DataFrame
df = spark.createDataFrame(data, columns)

# Show the DataFrame
df.show()

+-----+---+--------------+
| Name|Age|    Occupation|
+-----+---+--------------+
|Alice| 28|Data Scientist|
|  Bob| 35|      Engineer|
|Cathy| 32|       Analyst|
+-----+---+--------------+

In [ ]:
# Register DataFrame as a SQL table
df.createOrReplaceTempView("people")

# Verify the table creation
spark.sql("SHOW TABLES").show()

+---------+---------+-----------+
|namespace|tableName|isTemporary|
+---------+---------+-----------+
|         |   people|       true|
+---------+---------+-----------+

In [ ]:
# Query 1: Select all data
result = spark.sql("SELECT * FROM people")
result.show()

# Query 2: Filter rows
filtered_result = spark.sql("SELECT Name, Age FROM people WHERE Age > 30")
filtered_result.show()

# Query 3: Aggregate function
average_age = spark.sql("SELECT AVG(Age) AS Average_Age FROM people")
average_age.show()

+-----+---+--------------+
| Name|Age|    Occupation|
+-----+---+--------------+
|Alice| 28|Data Scientist|
|  Bob| 35|      Engineer|
|Cathy| 32|       Analyst|
+-----+---+--------------+

+-----+---+
| Name|Age|
+-----+---+
|  Bob| 35|
|Cathy| 32|
+-----+---+

+------------------+
|       Average_Age|
+------------------+
|31.666666666666668|
+------------------+

In [ ]:
# Query 4: Sort data by age (ascending)
sorted_result = spark.sql("SELECT * FROM people ORDER BY Age ASC")
sorted_result.show()

+-----+---+--------------+
| Name|Age|    Occupation|
+-----+---+--------------+
|Alice| 28|Data Scientist|
|Cathy| 32|       Analyst|
|  Bob| 35|      Engineer|
+-----+---+--------------+

In [ ]:

# Query 5: Count the number of people in the dataset
count_result = spark.sql("SELECT COUNT(*) AS Total_People FROM people")
count_result.show()

+------------+
|Total_People|
+------------+
|           3|
+------------+

In [ ]:
# Query 6: Group by occupation and count
grouped_result = spark.sql("SELECT Occupation, COUNT(*) AS Count FROM people GROUP BY Occupation")
grouped_result.show()

+--------------+-----+
|    Occupation|Count|
+--------------+-----+
|Data Scientist|    1|
|       Analyst|    1|
|      Engineer|    1|
+--------------+-----+

In [ ]:
# Query 7: Add a calculated column (age in 5 years)
calculated_result = spark.sql("SELECT Name, Age, Age + 5 AS Age_In_5_Years FROM people")
calculated_result.show()

+-----+---+--------------+
| Name|Age|Age_In_5_Years|
+-----+---+--------------+
|Alice| 28|            33|
|  Bob| 35|            40|
|Cathy| 32|            37|
+-----+---+--------------+

In [ ]:
# Query 8: Use WHERE with multiple conditions
filtered_conditions = spark.sql("SELECT * FROM people WHERE Age > 25 AND Occupation = 'Engineer'")
filtered_conditions.show()

+----+---+----------+
|Name|Age|Occupation|
+----+---+----------+
| Bob| 35|  Engineer|
+----+---+----------+

In [ ]:

# Query 9: Join Example (Self-Join for Demonstration)
# Create another DataFrame for joining
additional_data = [
    ("Alice", "Team A"),
    ("Bob", "Team B"),
    ("Cathy", "Team A"),
]
additional_columns = ["Name", "Team"]
additional_df = spark.createDataFrame(additional_data, additional_columns)

# Register additional DataFrame as a SQL table
additional_df.createOrReplaceTempView("teams")

# Perform a join
joined_result = spark.sql("""
    SELECT p.Name, p.Age, t.Team
    FROM people p
    JOIN teams t
    ON p.Name = t.Name
""")
joined_result.show()

+-----+---+------+
| Name|Age|  Team|
+-----+---+------+
|Alice| 28|Team A|
|  Bob| 35|Team B|
|Cathy| 32|Team A|
+-----+---+------+